Applying **Development**:

```diff
[0m[1mrandom_id.this: Refreshing state... [id=3A][0m
[0m[1mdata.http.my_public_ip: Reading...[0m[0m
[0m[1mdata.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json][0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Read complete after 0s [id=us-west-2][0m
[0m[1mrandom_shuffle.az: Refreshing state... [id=-][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=447552758530][0m
[0m[1maws_vpc.this[0]: Refreshing state... [id=vpc-0253c98dbfb2527bc][0m
[0m[1maws_security_group.lan[0]: Refreshing state... [id=sg-05eea34b7c5aad93d][0m
[0m[1maws_security_group.trusted[0]: Refreshing state... [id=sg-0f1628227c3620510][0m
[0m[1maws_subnet.private[0]: Refreshing state... [id=subnet-05d3787cbf200ae15][0m
[0m[1maws_security_group.public[0]: Refreshing state... [id=sg-06ed1ac4a4a40a5df][0m
[0m[1maws_subnet.public[0]: Refreshing state... [id=subnet-0bcb86926463a54da][0m
[0m[1maws_internet_gateway.this[0]: Refreshing state... [id=igw-0bb7ce12cebee95cc][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # aws_route_table.public[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "pub-rtb-sophos-xgdc-447552758530"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name" = "pub-rtb-sophos-xgdc-447552758530"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = "vpc-0253c98dbfb2527bc"
    }

[1m  # aws_security_group.trusted[0][0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_security_group" "trusted" {
        [1m[0mid[0m[0m                     = "sg-0f1628227c3620510"
      [33m~[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"13.84.54.58/32",
                ]
              [32m+[0m [0mdescription      = "Allow all from trusted IP"
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 65535
            },
          [31m-[0m [0m{
              [31m-[0m [0mcidr_blocks      = [
                  [31m-[0m [0m"20.225.222.31/32",
                ]
              [31m-[0m [0mdescription      = "Allow all from trusted IP"
              [31m-[0m [0mfrom_port        = 0
              [31m-[0m [0mipv6_cidr_blocks = []
              [31m-[0m [0mprefix_list_ids  = []
              [31m-[0m [0mprotocol         = "tcp"
              [31m-[0m [0msecurity_groups  = []
              [31m-[0m [0mself             = false
              [31m-[0m [0mto_port          = 65535
            },
        ]
        [1m[0mname[0m[0m                   = "Trusted Network"
        [1m[0mtags[0m[0m                   = {
            "Name" = "Trusted Network"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

```
[0m[1mrandom_id.this: Refreshing state... [id=3A][0m
[0m[1mdata.http.my_public_ip: Reading...[0m[0m
[0m[1mdata.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json][0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mdata.aws_availability_zones.available: Read complete after 0s [id=us-west-2][0m
[0m[1mrandom_shuffle.az: Refreshing state... [id=-][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 1s [id=447552758530][0m
[0m[1maws_vpc.this[0]: Refreshing state... [id=vpc-0253c98dbfb2527bc][0m
[0m[1maws_security_group.lan[0]: Refreshing state... [id=sg-05eea34b7c5aad93d][0m
[0m[1maws_internet_gateway.this[0]: Refreshing state... [id=igw-0bb7ce12cebee95cc][0m
[0m[1maws_subnet.public[0]: Refreshing state... [id=subnet-0bcb86926463a54da][0m
[0m[1maws_security_group.trusted[0]: Refreshing state... [id=sg-0f1628227c3620510][0m
[0m[1maws_subnet.private[0]: Refreshing state... [id=subnet-05d3787cbf200ae15][0m
[0m[1maws_security_group.public[0]: Refreshing state... [id=sg-06ed1ac4a4a40a5df][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # aws_route_table.public[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "pub-rtb-sophos-xgdc-447552758530"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {
          [32m+[0m [0m"Name" = "pub-rtb-sophos-xgdc-447552758530"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = "vpc-0253c98dbfb2527bc"
    }

[1m  # aws_security_group.trusted[0][0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_security_group" "trusted" {
        [1m[0mid[0m[0m                     = "sg-0f1628227c3620510"
      [33m~[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"13.84.54.58/32",
                ]
              [32m+[0m [0mdescription      = "Allow all from trusted IP"
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 65535
            },
          [31m-[0m [0m{
              [31m-[0m [0mcidr_blocks      = [
                  [31m-[0m [0m"20.225.222.31/32",
                ]
              [31m-[0m [0mdescription      = "Allow all from trusted IP"
              [31m-[0m [0mfrom_port        = 0
              [31m-[0m [0mipv6_cidr_blocks = []
              [31m-[0m [0mprefix_list_ids  = []
              [31m-[0m [0mprotocol         = "tcp"
              [31m-[0m [0msecurity_groups  = []
              [31m-[0m [0mself             = false
              [31m-[0m [0mto_port          = 65535
            },
        ]
        [1m[0mname[0m[0m                   = "Trusted Network"
        [1m[0mtags[0m[0m                   = {
            "Name" = "Trusted Network"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[0m[1maws_route_table.public[0]: Creating...[0m[0m
[0m[1maws_security_group.trusted[0]: Modifying... [id=sg-0f1628227c3620510][0m[0m
[0m[1maws_route_table.public[0]: Creation complete after 1s [id=rtb-0e60bd76d51edd1e4][0m
[0m[1maws_security_group.trusted[0]: Modifications complete after 2s [id=sg-0f1628227c3620510][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
[0m
```